1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.
2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.
3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.
4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.
5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.
6. All the companies that don't include the partners field.
7. All the companies that have a null type of value on the category_code field.
8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.
9. Order all the companies by their IPO price descendently.
10. Retrieve the 10 companies with more employees, order by the number of employees
11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.
12. All the companies that have been 'deadpooled' after the third year.
13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000
14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.
15. Order the companies by their founded year, retrieving only their name and founded year.
16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.
17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.
18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.
19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.
20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [39]:
import os
import pymongo
import numpy as np
import pandas as pd
import scipy
import matplotlib.pyplot as plt
from scipy import stats
from pprint import pprint
from pandas.io.json import json_normalize
from pymongo import MongoClient

In [58]:
client = MongoClient("mongodb://pedrocd:pedrociddiaz1@ds029565.mlab.com:29565/mydb")
db = client.mydb

In [60]:
docs = db.companies.find_one()
for k in docs:
    print(k)

_id
name
permalink
crunchbase_url
homepage_url
blog_url
blog_feed_url
twitter_username
category_code
number_of_employees
founded_year
deadpooled_year
tag_list
alias_list
email_address
phone_number
description
created_at
updated_at
overview
image
products
relationships
competitions
providerships
total_money_raised
funding_rounds
investments
acquisition
acquisitions
offices
milestones
video_embeds
screenshots
external_links
partners

1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.

In [62]:
companies = db.companies.find({"name":"Babelgum"},projection={ "name": 1 , "_id": 0})
df = pd.DataFrame(list(companies))
print('Number of companies: ' + str(len(df)))
df

Number of companies: 1

       name
0  Babelgum

2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.

In [65]:
companies = db.companies.find({"number_of_employees":{"$gt":5000}},
                          projection={ "name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING).limit(20)
df = pd.DataFrame(list(companies))
df

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.

In [66]:
companies = db.companies.find({"founded_year":{"$gte":2000, "$lte":2005}},
                          projection={ "name": 1 , "founded_year": 1, "_id": 0}).sort("founded_year", pymongo.DESCENDING).limit(20)
df = pd.DataFrame(list(companies))
print('Number of companies: ' + str(len(df)))
df

Number of companies: 20

    founded_year             name
0           2005         Wetpaint
1           2005             Zoho
2           2005        Omnidrive
3           2005            Helio
4           2005  Jingle Networks
5           2005         LifeLock
6           2005           Wesabe
7           2005        Jangl SMS
8           2005            Jajah
9           2005          YouTube
10          2005        Revision3
11          2005           iSkoot
12          2005       ClipBlast!
13          2005             Zlio
14          2005      Dailymotion
15          2005          RockYou
16          2005    Instructables
17          2005         Netvibes
18          2005           Swivel
19          2005            Slide

4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.

In [67]:
companies = db.companies.find({"acquisition.price_amount":{"$gte":100000000}},
                          projection={ "name": 1 ,"acquisition.price_amount": 1, "_id": 0})
df = pd.DataFrame(list(companies))
df["acquisition"] = json_normalize(df["acquisition"])
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 372

   acquisition        name
0    625000000     Postini
1    150000000       Plaxo
2    100000000    Powerset
3    102000000     SpinVox
4    327000000  NetRatings

5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [69]:
companies = db.companies.find({"number_of_employees":{"$lt":1000}, "founded_year":{"$lt":2005}},
                          projection={ "name": 1 ,"number_of_employees": 1,"founded_year": 1, "_id": 0}).sort("number_of_employees", pymongo.DESCENDING).limit(10)
df = pd.DataFrame(list(companies))
df

   founded_year                             name  number_of_employees
0          2000             Infinera Corporation                  974
1          1997  NorthPoint Communications Group                  948
2          1997                     888 Holdings                  931
3          1983               Forrester Research                  903
4          1991                        SonicWALL                  900
5          1999                       Webmetrics                  900
6          1999             Cornerstone OnDemand                  881
7          2004                             Yelp                  800
8          2003                          MySpace                  800
9          2000                         ZoomInfo                  800

6. All the companies that don't include the partners field.

In [70]:
companies = db.companies.find({"partners.0":{"$exists": False }},
                          projection={ "name": 1 ,"partners": 1,"_id": 0})
df = pd.DataFrame(list(companies))
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 18647

              name partners
0        AdventNet       []
1  TechnologyGuide       []
2          Snimmer       []
3         Wetpaint       []
4             Zoho       []

7. All the companies that have a null type of value on the category_code field.

In [71]:
companies = db.companies.find({"category_code":{"$exists": False}},
                          projection={ "name": 1 ,"category_code": 1,"_id": 0})
df = pd.DataFrame(list(companies))
len(df)

0

8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.

In [72]:
companies = db.companies.find({"number_of_employees":{"$gte":100, "$lte":1000}},
                          projection={ "name": 1 ,"number_of_employees": 1, "_id": 0}).sort("number_of_employees", pymongo.DESCENDING)
df = pd.DataFrame(list(companies))
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 942

                  name  number_of_employees
0  Akamai Technologies                 1000
1             Omniture                 1000
2                Yodle                 1000
3       Sonus Networks                 1000
4              Telenav                 1000

9. Order all the companies by their IPO price descendently.

In [73]:
companies = db.companies.find({"ipo.valuation_amount":{"$gte": 0}},
                          projection={ "name": 1 ,"ipo.valuation_amount": 1, "_id": 0}).sort("ipo.valuation_amount", pymongo.DESCENDING)
df = pd.DataFrame(list(companies))
df['ipo'] = json_normalize(df['ipo'])/1000000
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 61

        ipo      name
0  108960.0      GREE
1  104000.0  Facebook
2  100000.0    Amazon
3   18100.0   Twitter
4   12800.0   Groupon

10. Retrieve the 10 companies with more employees, order by the number of employees

In [74]:
companies = db.companies.find(projection={ "name": 1 ,"number_of_employees": 1, "_id": 0}).sort("number_of_employees", pymongo.DESCENDING).limit(10)
df = pd.DataFrame(list(companies))
df

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [82]:
companies = db.companies.find({"founded_month":{"$in": [7,8,9,10,11,12]}},
                          projection={ "name": 1 ,"founded_month": 1, "_id": 0}).limit(1000)
df = pd.DataFrame(list(companies))
df.head()

   founded_month             name
0             10  TechnologyGuide
1             10         Wetpaint
2              9             Zoho
3             10             Digg
4             11        Omnidrive

12. All the companies that have been 'deadpooled' after the third year.

13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000

In [97]:
companies = db.companies.find({"founded_year":{"$lt": 2000}, "acquisition.price_amount":{"$gte":10000000}},
                          projection={ "name": 1 ,"founded_year": 1, "acquisition.price_amount": 1,"_id": 0})
df = pd.DataFrame(list(companies))
df["acquisition"] = json_normalize(df["acquisition"])
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 209

   acquisition  founded_year        name
0    625000000          1999     Postini
1    180000000          1999    SideStep
2     25000000          1999  Recipezaar
3   1500000000          1998      PayPal
4    300000000          1999    Snapfish

14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.

In [99]:
companies = db.companies.find({"founded_year":{"$gt": 2005}},
                          projection={ "name": 1, "acquisition.price_amount": 1, "_id": 0}).sort('acquisition.price_amount' , pymongo.DESCENDING)
df = pd.DataFrame(list(companies))
print('Number of companies: ' + str(len(df)))
df.head()

Number of companies: 7008

                    acquisition                name
0  {'price_amount': 1200000000}              Meraki
1  {'price_amount': 1200000000}              Yammer
2  {'price_amount': 1200000000}              Yammer
3  {'price_amount': 1150000000}  Pearl Therapeutics
4  {'price_amount': 1100000000}              Tumblr